In [1]:
#1)Basics

In [2]:
people={
    "First name":["Narendra","Rahul","Amit","Nirav"],
    "Last name":["Modi","Gandhi","Shah","Modi"],
    "Email":["nm@gmail.com","rg@yahoo.com","as@hotmail.com","niv@gmail.com"],
}

In [3]:
people["Email"]

['nm@gmail.com', 'rg@yahoo.com', 'as@hotmail.com', 'niv@gmail.com']

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)

In [6]:
df

  First name Last name           Email
0   Narendra      Modi    nm@gmail.com
1      Rahul    Gandhi    rg@yahoo.com
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com

In [7]:
df["Email"]

0      nm@gmail.com
1      rg@yahoo.com
2    as@hotmail.com
3     niv@gmail.com
Name: Email, dtype: object

In [8]:
#2)Series

In [9]:
type(df["Email"])
#Series is basically a single column of rows. If there are more than 1 column then it is no longer a series.
#As per the basic definition Series is an array

pandas.core.series.Series

In [10]:
df.Email

0      nm@gmail.com
1      rg@yahoo.com
2    as@hotmail.com
3     niv@gmail.com
Name: Email, dtype: object

In [11]:
df[["First name","Last name"]]

  First name Last name
0   Narendra      Modi
1      Rahul    Gandhi
2       Amit      Shah
3      Nirav      Modi

In [12]:
df.columns

Index(['First name', 'Last name', 'Email'], dtype='object')

In [13]:
df.iloc[0:1,0:1]
#Integer values of rowsxcolumns are given to filter the data. iloc in pandas takes the row NUMBERS as the input

  First name
0   Narendra

In [14]:
df.iloc[[0,1],[0,1]]

  First name Last name
0   Narendra      Modi
1      Rahul    Gandhi

In [15]:
df

  First name Last name           Email
0   Narendra      Modi    nm@gmail.com
1      Rahul    Gandhi    rg@yahoo.com
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com

In [16]:
df.loc[[0,1],["First name","Email"]]

  First name         Email
0   Narendra  nm@gmail.com
1      Rahul  rg@yahoo.com

In [17]:
#3)Indexing

In [18]:
#Default index
df
#Pandas doesn't force you to have unique index but it is one of the best practice to have them unique

  First name Last name           Email
0   Narendra      Modi    nm@gmail.com
1      Rahul    Gandhi    rg@yahoo.com
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com

In [19]:
df['Email']

0      nm@gmail.com
1      rg@yahoo.com
2    as@hotmail.com
3     niv@gmail.com
Name: Email, dtype: object

In [20]:
df2=df.set_index("Email")
#This is used to check how the dataframe looks when we have email as the index but it really doesnt change anything unless you specify it

In [21]:
df2
df

  First name Last name           Email
0   Narendra      Modi    nm@gmail.com
1      Rahul    Gandhi    rg@yahoo.com
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com

In [22]:
df.set_index("Email",inplace=True)

In [23]:
df

               First name Last name
Email
nm@gmail.com     Narendra      Modi
rg@yahoo.com        Rahul    Gandhi
as@hotmail.com       Amit      Shah
niv@gmail.com       Nirav      Modi

In [24]:
df.index

Index(['nm@gmail.com', 'rg@yahoo.com', 'as@hotmail.com', 'niv@gmail.com'], dtype='object', name='Email')

In [25]:
df.loc["nm@gmail.com","First name"]

'Narendra'

In [26]:
df.loc["nm@gmail.com","Last name"]

'Modi'

In [27]:
df.iloc[0,0]

'Narendra'

In [28]:
df.reset_index()

            Email First name Last name
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [29]:
df

               First name Last name
Email
nm@gmail.com     Narendra      Modi
rg@yahoo.com        Rahul    Gandhi
as@hotmail.com       Amit      Shah
niv@gmail.com       Nirav      Modi

In [30]:
df.reset_index(inplace=True)

In [31]:
df

            Email First name Last name
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [34]:
#4)Filtering the data
#Filtering is important in pandas because that is how we start dealing with the data. We filter the data first and then perform various operations on them.

In [35]:
df["Last name"]=="Modi"

0     True
1    False
2    False
3     True
Name: Last name, dtype: bool

In [36]:
filt = df["Last name"]=="Modi"

In [37]:
df[filt]

           Email First name Last name
0   nm@gmail.com   Narendra      Modi
3  niv@gmail.com      Nirav      Modi

In [38]:
df.loc[filt]

           Email First name Last name
0   nm@gmail.com   Narendra      Modi
3  niv@gmail.com      Nirav      Modi

In [39]:
df.loc[filt,'Email']

0     nm@gmail.com
3    niv@gmail.com
Name: Email, dtype: object

In [40]:
#We cannot use And and Or keywords which we use in basic python. We should use & and | for using operators

In [41]:
filt1= (df["Last name"]=="Modi" ) & (df["First name"]=="Nirav")

In [42]:
df.loc[filt1,"Email"]

3    niv@gmail.com
Name: Email, dtype: object

In [43]:
filt1= (df["Last name"]=="Modi" ) | (df["First name"]=="Nirav")
df.loc[filt1,"Email"]

0     nm@gmail.com
3    niv@gmail.com
Name: Email, dtype: object

In [44]:
#To print out all the values which are opposing the filter we can use the key "~"(Negation Filter)

In [45]:
filt1= (df["Last name"]=="Modi" ) | (df["First name"]=="Nirav")
df.loc[~filt1,"Email"]

1      rg@yahoo.com
2    as@hotmail.com
Name: Email, dtype: object

In [46]:
#Alter existing rows and columns in our dataframes

In [47]:
df

            Email First name Last name
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [48]:
df.columns

Index(['Email', 'First name', 'Last name'], dtype='object')

In [49]:
#updating all the columns to be more specific
df.columns = ["Email","First Name","Last Name"]

In [50]:
df

            Email First Name Last Name
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [51]:
#List comprehension to change the column names
df.columns = [x.upper() for x in df.columns]
df

            EMAIL FIRST NAME LAST NAME
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [52]:
#When we have a space in the column names we cannot use the attribute like df.First Name because the space will make the interpreter assume that it is another variable.

In [53]:
df.columns = df.columns.str.replace(' ','_')
df

            EMAIL FIRST_NAME LAST_NAME
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [54]:
df.columns = [x.lower() for x in df.columns]
df

            email first_name last_name
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [55]:
#What if we want to change only some columns in the dataframe instead of all the columns

In [56]:
df.rename(columns={"first_name":"First","last_name":"Last"})#without inplace=True

            email     First    Last
0    nm@gmail.com  Narendra    Modi
1    rg@yahoo.com     Rahul  Gandhi
2  as@hotmail.com      Amit    Shah
3   niv@gmail.com     Nirav    Modi

In [57]:
df

            email first_name last_name
0    nm@gmail.com   Narendra      Modi
1    rg@yahoo.com      Rahul    Gandhi
2  as@hotmail.com       Amit      Shah
3   niv@gmail.com      Nirav      Modi

In [58]:
df.rename(columns={"first_name":"First","last_name":"Last"},inplace=True)
df

            email     First    Last
0    nm@gmail.com  Narendra    Modi
1    rg@yahoo.com     Rahul  Gandhi
2  as@hotmail.com      Amit    Shah
3   niv@gmail.com     Nirav    Modi

In [59]:
#Updating a row in a data frame
df.loc[2]

email    as@hotmail.com
First              Amit
Last               Shah
Name: 2, dtype: object

In [60]:
#1.Changing the entire row
df.loc[2]=['md@gmail.com','Mohan','Das']
#This method is tedious if the number of columns is very high

In [61]:
df.loc[2]

email    md@gmail.com
First           Mohan
Last              Das
Name: 2, dtype: object

In [62]:
df

           email     First    Last
0   nm@gmail.com  Narendra    Modi
1   rg@yahoo.com     Rahul  Gandhi
2   md@gmail.com     Mohan     Das
3  niv@gmail.com     Nirav    Modi

In [63]:
#2.To change elemets of a row. We are changing the last name and email of row2
df.loc[2,["Last","email"]]=["DasGupta","mdg@gmail.com"]

In [64]:
df

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Rahul    Gandhi
2  mdg@gmail.com     Mohan  DasGupta
3  niv@gmail.com     Nirav      Modi

In [63]:
#Changing lastname back to das
df.loc[2,"Last"]="Das"

In [64]:
df

           email     First    Last
0   nm@gmail.com  Narendra    Modi
1   rg@yahoo.com     Rahul  Gandhi
2  mdg@gmail.com     Mohan     Das
3  niv@gmail.com     Nirav    Modi

In [65]:
#Most common Mistake is without using indexes: example:-
filt1 = (df['email']=='mdg@gmail.com')
df[filt1]

           email  First Last
2  mdg@gmail.com  Mohan  Das

In [66]:
df[filt1]["Last"]

2    Das
Name: Last, dtype: object

In [67]:
df[filt1]["Last"]="DasGupta"

<ipython-input-67-5ffe1243bf3e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt1]["Last"]="DasGupta"

In [68]:
#Setting with copy warning has occured. We can see that it is just a warning but something worked
df

           email     First    Last
0   nm@gmail.com  Narendra    Modi
1   rg@yahoo.com     Rahul  Gandhi
2  mdg@gmail.com     Mohan     Das
3  niv@gmail.com     Nirav    Modi

In [69]:
#The values did not change. Warning clearly mentions that we should use .loc instead of doing it on a slice
df.loc[filt1,"Last"]="DasGupta"
df
#This will work great! Never ignore the warnings

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Rahul    Gandhi
2  mdg@gmail.com     Mohan  DasGupta
3  niv@gmail.com     Nirav      Modi

In [70]:
#Updating multiple rows of data
df["email"]=df["email"].str.upper()
df

           email     First      Last
0   NM@GMAIL.COM  Narendra      Modi
1   RG@YAHOO.COM     Rahul    Gandhi
2  MDG@GMAIL.COM     Mohan  DasGupta
3  NIV@GMAIL.COM     Nirav      Modi

In [71]:
df["email"]=df["email"].str.lower()
df

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Rahul    Gandhi
2  mdg@gmail.com     Mohan  DasGupta
3  niv@gmail.com     Nirav      Modi

In [72]:
#Four important methods we can regularly use in pandas:-
#apply
#map
#applymap
#replace

In [73]:
#1.apply - it works on both series and dataframe

In [74]:
#a.Series
df["email"].apply(len)
#What this apply does is that it will apply the function give to every element of the given series

0    12
1    12
2    13
3    13
Name: email, dtype: int64

In [75]:
def update_email(email):
    return email.upper()

In [76]:
df["email"].apply(update_email)

0     NM@GMAIL.COM
1     RG@YAHOO.COM
2    MDG@GMAIL.COM
3    NIV@GMAIL.COM
Name: email, dtype: object

In [77]:
df

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Rahul    Gandhi
2  mdg@gmail.com     Mohan  DasGupta
3  niv@gmail.com     Nirav      Modi

In [78]:
df["email"]=df["email"].apply(update_email)

In [79]:
df

           email     First      Last
0   NM@GMAIL.COM  Narendra      Modi
1   RG@YAHOO.COM     Rahul    Gandhi
2  MDG@GMAIL.COM     Mohan  DasGupta
3  NIV@GMAIL.COM     Nirav      Modi

In [80]:
df["email"]=df["email"].apply(lambda x : x.lower())
df
#x = lambda input : output. x becomes a function

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Rahul    Gandhi
2  mdg@gmail.com     Mohan  DasGupta
3  niv@gmail.com     Nirav      Modi

In [81]:
#b.Dataframe
df.apply(len)#It is applying it to each series in the dataframe. It is giving us the length of each series

email    4
First    4
Last     4
dtype: int64

In [82]:
#axis=0 means applying it to rows, axis=1 means applying it to columns
df.apply(len,axis="rows")

email    4
First    4
Last     4
dtype: int64

In [83]:
df.apply(len,axis="columns")#giving us the length columnwise

0    3
1    3
2    3
3    3
dtype: int64

In [84]:
#2. applymap -  works only for dataframes. useless with series as we can use apply
df.applymap(len)#This function applies the function to each and every element of the dataframe.
#tip:-use apply for series and applymap for dataframe

   email  First  Last
0     12      8     4
1     12      5     6
2     13      5     8
3     13      5     4

In [85]:
df.applymap(str.lower)

           email     First      Last
0   nm@gmail.com  narendra      modi
1   rg@yahoo.com     rahul    gandhi
2  mdg@gmail.com     mohan  dasgupta
3  niv@gmail.com     nirav      modi

In [86]:
#3.map - works only with series
df

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Rahul    Gandhi
2  mdg@gmail.com     Mohan  DasGupta
3  niv@gmail.com     Nirav      Modi

In [87]:
df['First'].map({"Rahul":"Sonia","Mohan":"Krishna"})

0        NaN
1      Sonia
2    Krishna
3        NaN
Name: First, dtype: object

In [88]:
#Values that we substituted turned into what we wanted but others turned into NaN

In [89]:
#4.replace
df['First'].replace({"Rahul":"Sonia","Mohan":"Krishna"})

0    Narendra
1       Sonia
2     Krishna
3       Nirav
Name: First, dtype: object

In [90]:
#Most common method we use is replace as it is simpler
df['First']=df['First'].replace({"Rahul":"Sonia","Mohan":"Krishna"})

In [91]:
df

           email     First      Last
0   nm@gmail.com  Narendra      Modi
1   rg@yahoo.com     Sonia    Gandhi
2  mdg@gmail.com   Krishna  DasGupta
3  niv@gmail.com     Nirav      Modi

In [92]:
#6)Adding and removing rows,columns from Dataframes

In [93]:
#Adding first name + ' ' + last name
df["First"]+' '+df["Last"]

0       Narendra Modi
1        Sonia Gandhi
2    Krishna DasGupta
3          Nirav Modi
dtype: object

In [94]:
df["Full name"]=df["First"]+' '+df["Last"]

In [95]:
df.rename(columns={"email":"Email"},inplace=True)

In [96]:
df

           Email     First      Last         Full name
0   nm@gmail.com  Narendra      Modi     Narendra Modi
1   rg@yahoo.com     Sonia    Gandhi      Sonia Gandhi
2  mdg@gmail.com   Krishna  DasGupta  Krishna DasGupta
3  niv@gmail.com     Nirav      Modi        Nirav Modi

In [97]:
#Removing columns
df.drop(columns=["First","Last"])

           Email         Full name
0   nm@gmail.com     Narendra Modi
1   rg@yahoo.com      Sonia Gandhi
2  mdg@gmail.com  Krishna DasGupta
3  niv@gmail.com        Nirav Modi

In [98]:
df.drop(columns=["First","Last"],inplace=True)

In [99]:
df

           Email         Full name
0   nm@gmail.com     Narendra Modi
1   rg@yahoo.com      Sonia Gandhi
2  mdg@gmail.com  Krishna DasGupta
3  niv@gmail.com        Nirav Modi

In [100]:
#Getting back our firstname and lastname

In [101]:
df["Full name"].str.split(" ")

0       [Narendra, Modi]
1        [Sonia, Gandhi]
2    [Krishna, DasGupta]
3          [Nirav, Modi]
Name: Full name, dtype: object

In [102]:
df["Full name"].str.split(" ",expand=True)

          0         1
0  Narendra      Modi
1     Sonia    Gandhi
2   Krishna  DasGupta
3     Nirav      Modi

In [103]:
df[["First","Last"]]=df["Full name"].str.split(" ",expand=True)

In [104]:
df

           Email         Full name     First      Last
0   nm@gmail.com     Narendra Modi  Narendra      Modi
1   rg@yahoo.com      Sonia Gandhi     Sonia    Gandhi
2  mdg@gmail.com  Krishna DasGupta   Krishna  DasGupta
3  niv@gmail.com        Nirav Modi     Nirav      Modi

In [105]:
#Adding single row
df.append({"First":"Khabib"},ignore_index=True)

           Email         Full name     First      Last
0   nm@gmail.com     Narendra Modi  Narendra      Modi
1   rg@yahoo.com      Sonia Gandhi     Sonia    Gandhi
2  mdg@gmail.com  Krishna DasGupta   Krishna  DasGupta
3  niv@gmail.com        Nirav Modi     Nirav      Modi
4            NaN               NaN    Khabib       NaN

In [106]:
people={
    "First":["Mohan","Kiran","Ross","Joseph"],
    "Last":["Das","Ralli","Bran","Tribiani"],
    "Email":["md@gmail.com","kr@yahoo.com","rb@hotmail.com","jt@gmail.com"],
}

In [107]:
df2=pd.DataFrame(people)

In [108]:
df2

    First      Last           Email
0   Mohan       Das    md@gmail.com
1   Kiran     Ralli    kr@yahoo.com
2    Ross      Bran  rb@hotmail.com
3  Joseph  Tribiani    jt@gmail.com

In [109]:
#Concatination of two dataframes

In [110]:
#ignore_index=True will make a new index row with unique serial numbers
df.append(df2,ignore_index=True)

            Email         Full name     First      Last
0    nm@gmail.com     Narendra Modi  Narendra      Modi
1    rg@yahoo.com      Sonia Gandhi     Sonia    Gandhi
2   mdg@gmail.com  Krishna DasGupta   Krishna  DasGupta
3   niv@gmail.com        Nirav Modi     Nirav      Modi
4    md@gmail.com               NaN     Mohan       Das
5    kr@yahoo.com               NaN     Kiran     Ralli
6  rb@hotmail.com               NaN      Ross      Bran
7    jt@gmail.com               NaN    Joseph  Tribiani

In [111]:
#This will repeat the index of both the dataframes
df.append(df2)

            Email         Full name     First      Last
0    nm@gmail.com     Narendra Modi  Narendra      Modi
1    rg@yahoo.com      Sonia Gandhi     Sonia    Gandhi
2   mdg@gmail.com  Krishna DasGupta   Krishna  DasGupta
3   niv@gmail.com        Nirav Modi     Nirav      Modi
0    md@gmail.com               NaN     Mohan       Das
1    kr@yahoo.com               NaN     Kiran     Ralli
2  rb@hotmail.com               NaN      Ross      Bran
3    jt@gmail.com               NaN    Joseph  Tribiani

In [112]:
df=df.append(df2,ignore_index=True)

In [113]:
df

            Email         Full name     First      Last
0    nm@gmail.com     Narendra Modi  Narendra      Modi
1    rg@yahoo.com      Sonia Gandhi     Sonia    Gandhi
2   mdg@gmail.com  Krishna DasGupta   Krishna  DasGupta
3   niv@gmail.com        Nirav Modi     Nirav      Modi
4    md@gmail.com               NaN     Mohan       Das
5    kr@yahoo.com               NaN     Kiran     Ralli
6  rb@hotmail.com               NaN      Ross      Bran
7    jt@gmail.com               NaN    Joseph  Tribiani

In [114]:
df.drop(index=4)#Deleting rows

            Email         Full name     First      Last
0    nm@gmail.com     Narendra Modi  Narendra      Modi
1    rg@yahoo.com      Sonia Gandhi     Sonia    Gandhi
2   mdg@gmail.com  Krishna DasGupta   Krishna  DasGupta
3   niv@gmail.com        Nirav Modi     Nirav      Modi
5    kr@yahoo.com               NaN     Kiran     Ralli
6  rb@hotmail.com               NaN      Ross      Bran
7    jt@gmail.com               NaN    Joseph  Tribiani

In [115]:
df.drop(index=df[df["Last"]=="Modi"].index)

            Email         Full name    First      Last
1    rg@yahoo.com      Sonia Gandhi    Sonia    Gandhi
2   mdg@gmail.com  Krishna DasGupta  Krishna  DasGupta
4    md@gmail.com               NaN    Mohan       Das
5    kr@yahoo.com               NaN    Kiran     Ralli
6  rb@hotmail.com               NaN     Ross      Bran
7    jt@gmail.com               NaN   Joseph  Tribiani

In [116]:
df[df["Last"]=="Modi"]

           Email      Full name     First  Last
0   nm@gmail.com  Narendra Modi  Narendra  Modi
3  niv@gmail.com     Nirav Modi     Nirav  Modi

In [117]:
filt = df['Last']=='Modi'
df.drop(index=df[filt].index)

            Email         Full name    First      Last
1    rg@yahoo.com      Sonia Gandhi    Sonia    Gandhi
2   mdg@gmail.com  Krishna DasGupta  Krishna  DasGupta
4    md@gmail.com               NaN    Mohan       Das
5    kr@yahoo.com               NaN    Kiran     Ralli
6  rb@hotmail.com               NaN     Ross      Bran
7    jt@gmail.com               NaN   Joseph  Tribiani

In [118]:
#7)Sorting Data

In [119]:
people={
    "First name":["Narendra","Rahul","Amit","Nirav","Arun"],
    "Last name":["Modi","Gandhi","Shah","Modi","Modi"],
    "Email":["nm@gmail.com","rg@yahoo.com","as@hotmail.com","niv@gmail.com","am@gmail.com"],
}

In [120]:
df=pd.DataFrame(people)

In [121]:
df

  First name Last name           Email
0   Narendra      Modi    nm@gmail.com
1      Rahul    Gandhi    rg@yahoo.com
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com
4       Arun      Modi    am@gmail.com

In [122]:
df.sort_values(by="Last name")

  First name Last name           Email
1      Rahul    Gandhi    rg@yahoo.com
0   Narendra      Modi    nm@gmail.com
3      Nirav      Modi   niv@gmail.com
4       Arun      Modi    am@gmail.com
2       Amit      Shah  as@hotmail.com

In [123]:
df.sort_values(by="Last name",ascending=False)

  First name Last name           Email
2       Amit      Shah  as@hotmail.com
0   Narendra      Modi    nm@gmail.com
3      Nirav      Modi   niv@gmail.com
4       Arun      Modi    am@gmail.com
1      Rahul    Gandhi    rg@yahoo.com

In [124]:
df.sort_values(by=["Last name","First name"],ascending=False)

  First name Last name           Email
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com
0   Narendra      Modi    nm@gmail.com
4       Arun      Modi    am@gmail.com
1      Rahul    Gandhi    rg@yahoo.com

In [125]:
#Lastname in Descending order and Firstname in Ascending order

In [126]:
df.sort_values(by=["Last name","First name"],ascending=[False,True])

  First name Last name           Email
2       Amit      Shah  as@hotmail.com
4       Arun      Modi    am@gmail.com
0   Narendra      Modi    nm@gmail.com
3      Nirav      Modi   niv@gmail.com
1      Rahul    Gandhi    rg@yahoo.com

In [127]:
df.sort_values(by=["Last name","First name"],ascending=[False,True],inplace=True)

In [128]:
df

  First name Last name           Email
2       Amit      Shah  as@hotmail.com
4       Arun      Modi    am@gmail.com
0   Narendra      Modi    nm@gmail.com
3      Nirav      Modi   niv@gmail.com
1      Rahul    Gandhi    rg@yahoo.com

In [129]:
#To get back our normal dataframe
df.sort_index()

  First name Last name           Email
0   Narendra      Modi    nm@gmail.com
1      Rahul    Gandhi    rg@yahoo.com
2       Amit      Shah  as@hotmail.com
3      Nirav      Modi   niv@gmail.com
4       Arun      Modi    am@gmail.com

In [130]:
df["Last name"].sort_values()

1    Gandhi
4      Modi
0      Modi
3      Modi
2      Shah
Name: Last name, dtype: object

In [144]:
#Cleaning the data
import numpy as np
people={
    "First name":["Narendra","Rahul","Amit","Nirav",np.nan,None,'NA'],
    "Last name":["Modi","Gandhi","Shah","Modi",np.nan,np.nan,'missing'],
    "Email":["nm@gmail.com","rg@yahoo.com","as@hotmail.com","niv@gmail.com",None,np.nan,'missing'],
    "age" : ['65','50','68','49',None,'missing','missing'],
    "grandparent":[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
}

In [145]:
df = pd.DataFrame(people)

In [146]:
df

  First name Last name           Email      age  grandparent
0   Narendra      Modi    nm@gmail.com       65          NaN
1      Rahul    Gandhi    rg@yahoo.com       50          NaN
2       Amit      Shah  as@hotmail.com       68          NaN
3      Nirav      Modi   niv@gmail.com       49          NaN
4        NaN       NaN            None     None          NaN
5       None       NaN             NaN  missing          NaN
6         NA   missing         missing  missing          NaN

In [147]:
df.dropna()#it will catch np.nan or None

Empty DataFrame
Columns: [First name, Last name, Email, age, grandparent]
Index: []

In [148]:
#default
df.dropna(axis=0,how='any')

Empty DataFrame
Columns: [First name, Last name, Email, age, grandparent]
Index: []

In [149]:
df.dropna(axis=0,how='all')

  First name Last name           Email      age  grandparent
0   Narendra      Modi    nm@gmail.com       65          NaN
1      Rahul    Gandhi    rg@yahoo.com       50          NaN
2       Amit      Shah  as@hotmail.com       68          NaN
3      Nirav      Modi   niv@gmail.com       49          NaN
5       None       NaN             NaN  missing          NaN
6         NA   missing         missing  missing          NaN

In [150]:
df.dropna(axis=1,how='all')

  First name Last name           Email      age
0   Narendra      Modi    nm@gmail.com       65
1      Rahul    Gandhi    rg@yahoo.com       50
2       Amit      Shah  as@hotmail.com       68
3      Nirav      Modi   niv@gmail.com       49
4        NaN       NaN            None     None
5       None       NaN             NaN  missing
6         NA   missing         missing  missing

In [151]:
df.dropna(axis=1,how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [154]:
df.dropna(axis=0,how='any',subset=['Email'])

  First name Last name           Email      age  grandparent
0   Narendra      Modi    nm@gmail.com       65          NaN
1      Rahul    Gandhi    rg@yahoo.com       50          NaN
2       Amit      Shah  as@hotmail.com       68          NaN
3      Nirav      Modi   niv@gmail.com       49          NaN
6         NA   missing         missing  missing          NaN

In [157]:
df.dropna(axis=0,how='all',subset=['First name','Last name'])#As long as we have first name and last name we dont drop the rows

  First name Last name           Email      age  grandparent
0   Narendra      Modi    nm@gmail.com       65          NaN
1      Rahul    Gandhi    rg@yahoo.com       50          NaN
2       Amit      Shah  as@hotmail.com       68          NaN
3      Nirav      Modi   niv@gmail.com       49          NaN
6         NA   missing         missing  missing          NaN

In [159]:
df = pd.DataFrame(people)

In [160]:
df.replace(['NA','missing'],np.nan,inplace=True)
df

  First name Last name           Email   age  grandparent
0   Narendra      Modi    nm@gmail.com    65          NaN
1      Rahul    Gandhi    rg@yahoo.com    50          NaN
2       Amit      Shah  as@hotmail.com    68          NaN
3      Nirav      Modi   niv@gmail.com    49          NaN
4        NaN       NaN            None  None          NaN
5       None       NaN             NaN   NaN          NaN
6        NaN       NaN             NaN   NaN          NaN

In [161]:
df.isna()

   First name  Last name  Email    age  grandparent
0       False      False  False  False         True
1       False      False  False  False         True
2       False      False  False  False         True
3       False      False  False  False         True
4        True       True   True   True         True
5        True       True   True   True         True
6        True       True   True   True         True

In [162]:
df.fillna('MISSING')

  First name Last name           Email      age grandparent
0   Narendra      Modi    nm@gmail.com       65     MISSING
1      Rahul    Gandhi    rg@yahoo.com       50     MISSING
2       Amit      Shah  as@hotmail.com       68     MISSING
3      Nirav      Modi   niv@gmail.com       49     MISSING
4    MISSING   MISSING         MISSING  MISSING     MISSING
5    MISSING   MISSING         MISSING  MISSING     MISSING
6    MISSING   MISSING         MISSING  MISSING     MISSING